MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24EP512GP806/hal_ll_pps_connection_defs.h
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_pps_connection_defs.h
 * @brief This file contains pps maps per chip for LOW LEVEL HAL PPS
 *        implementation for PIC24EP512GP806.
 */

#ifndef _HAL_LL_PPS_CONNECTION_DEFS_H_
#define _HAL_LL_PPS_CONNECTION_DEFS_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include "hal_ll_pps_struct_def.h"

/**
 * NOTE:
 * This macro is used for pins that do not have adequate PPS
 * registers according to datasheet.
 */
#define INVALID_PPS_ADDRESS (0) // TODO

// -------------------------------------------------------------

/*!< @brief PPS INPUT FUNCTIONS */
static const hal_ll_pps_pin_map_t hal_ll_pps_input_map[] =
{
    // --------- CAN --------- //
    #ifdef CAN1_RX_RE5_RP85
    {5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 85, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE5_RP85
    {5, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 85, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE7_RP87
    {7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 87, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE7_RP87
    {7, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 87, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG6_RP118
    {6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 118, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG6_RP118
    {6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 118, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG8_RP120
    {8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 120, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG8_RP120
    {8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 120, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF4_RP100
    {4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 100, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF4_RP100
    {4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 100, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF5_RP101
    {5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 101, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF5_RP101
    {5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 101, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF3_RP99
    {3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 99, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF3_RP99
    {3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 99, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF2_RP98
    {2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 98, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF2_RP98
    {2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 98, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF6_RP102
    {6, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 102, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF6_RP102
    {6, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 102, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD0_RP64
    {0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 64, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD0_RP64
    {0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 64, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD1_RP65
    {1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 65, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD1_RP65
    {1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 65, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD2_RP66
    {2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 66, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD2_RP66
    {2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 66, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD3_RP67
    {3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 67, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD3_RP67
    {3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 67, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD4_RP68
    {4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 68, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD4_RP68
    {4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 68, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD5_RP69
    {5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 69, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD5_RP69
    {5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 69, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD6_RP70
    {6, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 70, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD6_RP70
    {6, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 70, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD7_RP71
    {7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 71, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD7_RP71
    {7, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 71, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF0_RP96
    {0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 96, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF0_RP96
    {0, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 96, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RF1_RP97
    {1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 97, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RF1_RP97
    {1, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 97, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE0_RP80
    {0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 80, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE0_RP80
    {0, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 80, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE2_RP82
    {2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 82, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE2_RP82
    {2, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 82, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE4_RP84
    {4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 84, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE4_RP84
    {4, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 84, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE6_RPI86
    {6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 86, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE6_RPI86
    {6, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 86, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG7_RPI119
    {7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 119, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG7_RPI119
    {7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 119, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RG9_RPI121
    {9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 121, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RG9_RPI121
    {9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 121, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB5_RPI37
    {5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 37, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB5_RPI37
    {5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 37, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB4_RPI36
    {4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 36, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB4_RPI36
    {4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 36, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB3_RPI35
    {3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 35, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB3_RPI35
    {3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 35, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB2_RPI34
    {2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 34, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB2_RPI34
    {2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 34, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB1_RPI33
    {1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 33, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB1_RPI33
    {1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 33, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB0_RPI32
    {0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 32, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB0_RPI32
    {0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 32, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB6_RPI38
    {6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 38, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB6_RPI38
    {6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 38, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB7_RPI39
    {7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 39, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB7_RPI39
    {7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 39, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB8_RPI40
    {8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 40, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB8_RPI40
    {8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 40, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB9_RPI41
    {9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 41, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB9_RPI41
    {9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 41, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB10_RPI42
    {10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 42, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB10_RPI42
    {10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 42, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB11_RPI43
    {11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 43, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB11_RPI43
    {11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 43, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB12_RPI44
    {12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 44, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB12_RPI44
    {12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 44, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB13_RPI45
    {13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 45, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB13_RPI45
    {13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 45, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB14_RPI46
    {14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 46, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB14_RPI46
    {14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 46, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RB15_RPI47
    {15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 47, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RB15_RPI47
    {15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 47, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC12_RPI60
    {12, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 60, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC12_RPI60
    {12, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 60, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD8_RPI72
    {8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 72, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD8_RPI72
    {8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 72, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD9_RPI73
    {9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 73, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD9_RPI73
    {9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 73, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD10_RPI74
    {10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 74, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD10_RPI74
    {10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 74, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RD11_RPI75
    {11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 75, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RD11_RPI75
    {11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 75, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC13_RPI61
    {13, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 61, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC13_RPI61
    {13, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 61, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RC14_RPI62
    {14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 62, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RC14_RPI62
    {14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 62, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE1_RPI81
    {1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 81, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE1_RPI81
    {1, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 81, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN1_RX_RE3_RPI83
    {3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 83, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    #ifdef CAN2_RX_RE3_RPI83
    {3, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_CAN, 83, HAL_LL_PPS_MODULE_INDEX_2, HAL_LL_RPINR26_REG_ADDRESS},
    #endif
    // ------- EOF CAN ------- //
    #ifdef UART1_RX_RB0_RPI32
    {GPIO_PIN_0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 32, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB1_RPI33
    {GPIO_PIN_1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 33, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB10_RPI42
    {GPIO_PIN_10, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 42, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB11_RPI43
    {GPIO_PIN_11, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 43, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB12_RPI44
    {GPIO_PIN_12, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 44, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB13_RPI45
    {GPIO_PIN_13, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 45, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB14_RPI46
    {GPIO_PIN_14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 46, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB15_RPI47
    {GPIO_PIN_15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 47, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB2_RPI34
    {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 34, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB3_RPI35
    {GPIO_PIN_3, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 35, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB4_RPI36
    {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 36, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB5_RPI37
    {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 37, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB6_RPI38
    {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 38, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB7_RPI39
    {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 39, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB8_RPI40
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 40, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RB9_RPI41
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 41, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RC12_RPI60
    {GPIO_PIN_12, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 60, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RC13_RPI61
    {GPIO_PIN_13, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 61, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RC14_RPI62
    {GPIO_PIN_14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_UART, 62, HAL_LL_PPS_MODULE_INDEX_1, HAL_LL_RPINR18_REG_ADDRESS},
    #endif
    #ifdef UART1_RX_RD0_RP64
